blog/2016-07-05-httpd.org
#+TITLE: httpd
#+DATE: 2016-07-05
#+SETUPFILE: ~/myblog/setupfile.org
#+JEKYLL_LAYOUT: post
#+JEKYLL_CATEGORIES: Linux
#+JEKYLL_TAGS: Linux 运维 网络
#+JEKYLL_PUBLISHED: true

TODO




-----
#+BEGIN_EXAMPLE
httpd开发者创建了apache
a patchy server = apache
ASF: apache software foundation
#+END_EXAMPLE
* httpd的特性
- 高度模块化：core + modules
- DSO: Dynamic Shared Object，支持动态装卸载
- MPM：Multi-Processing Modules
  - prefork：多进程模型 ::
       一个主进程负责生成多个子进程，每个子进程处理一个用户请求；即便没有用户请求，也会预先生成多个空闲进程，随时等待请求到达；最大不会超过1024个
  - worker：多线程模型 ::
       一个主进程生成多个子进程，每个子进程负责生个多个线程，每个线程响应一个请求
  - event：事件驱动模型(httpd-2.4) :: 
       一个主进程生成多个子进程，每个进程响应多个请求
* httpd的功能
- 虚拟主机: IP、Port、FQDN
- CGI：Common Gateway Interface，通用网关接口
- 反向代理
- 负载均衡
- 路径别名
- 用户认证机制: basic、digest
- 支持第三方模块
* CentOS 6的httpd
** 程序环境
- 配置文件 ::
     #+BEGIN_VERSE
     /etc/httpd/conf/httpd.conf
     /etc/httpd/conf.d/*.conf
     #+END_VERSE
- 服务脚本 :: 
     #+BEGIN_VERSE
     /etc/rc.d/init.d/httpd
     配置文件：/etc/sysconfig/httpd
     #+END_VERSE
- 主程序文件 :: 
     #+BEGIN_VERSE
     /usr/sbin/httpd: 使用prefork模型
     /usr/sbin/httpd.event
     /usr/sbin/httpd.worker
     #+END_VERSE
- 日志文件 :: 
     #+BEGIN_VERSE
     /var/log/httpd/access_log: 访问日志
     /var/log/httpd/error_log：错误日志
     #+END_VERSE
- 站点文档目录 :: 
     /var/www/html
- 模块文件路径 ::
     /usr/lib64/httpd/modules
** 配置文件
*** 配置文件组成
#+BEGIN_SRC conf
### Section 1: Global Environment
### Section 2: 'Main' server configuration
### Section 3: Virtual Hosts
#+END_SRC
*** 修改监听的IP和端口
#+BEGIN_SRC conf
Listen [IP:]PORT  
#+END_SRC
- 省略ip表示监听本机所有IP
- Listen可重复出现多次，即同时监听多个端口
*** 持久连接


