_posts/2016-07-05-httpd.html
---
title: "httpd"
date: 2016-07-05
layout: post
categories: 
- Linux
tags: 
- Linux 
- 运维 
- 网络
published: true
comments: 
---
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">1. httpd的特性</a></li>
<li><a href="#orgheadline2">2. httpd的功能</a></li>
<li><a href="#orgheadline8">3. CentOS 6的httpd</a>
<ul>
<li><a href="#orgheadline3">程序环境</a></li>
<li><a href="#orgheadline7">配置文件</a>
<ul>
<li><a href="#orgheadline4">配置文件组成</a></li>
<li><a href="#orgheadline5">修改监听的IP和端口</a></li>
<li><a href="#orgheadline6">持久连接</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<p>
TODO
</p>




<hr  />
<pre class="example">
httpd开发者创建了apache
a patchy server = apache
ASF: apache software foundation
</pre>
<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1"><span class="section-number-2">1</span> httpd的特性</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>高度模块化：core + modules</li>
<li>DSO: Dynamic Shared Object，支持动态装卸载</li>
<li>MPM：Multi-Processing Modules
<dl class="org-dl">
<dt>prefork：多进程模型</dt><dd>一个主进程负责生成多个子进程，每个子进程处理一个用户请求；即便没有用户请求，也会预先生成多个空闲进程，随时等待请求到达；最大不会超过1024个</dd>
<dt>worker：多线程模型</dt><dd>一个主进程生成多个子进程，每个子进程负责生个多个线程，每个线程响应一个请求</dd>
<dt>event：事件驱动模型(httpd-2.4)</dt><dd>一个主进程生成多个子进程，每个进程响应多个请求</dd>
</dl></li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline2" class="outline-2">
<h2 id="orgheadline2"><span class="section-number-2">2</span> httpd的功能</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>虚拟主机: IP、Port、FQDN</li>
<li>CGI：Common Gateway Interface，通用网关接口</li>
<li>反向代理</li>
<li>负载均衡</li>
<li>路径别名</li>
<li>用户认证机制: basic、digest</li>
<li>支持第三方模块</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline8" class="outline-2">
<h2 id="orgheadline8"><span class="section-number-2">3</span> CentOS 6的httpd</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-orgheadline3" class="outline-3">
<h3 id="orgheadline3">程序环境</h3>
<div class="outline-text-3" id="text-orgheadline3">
<dl class="org-dl">
<dt>配置文件</dt><dd><p class="verse">
/etc/httpd/conf/httpd.conf<br  />
/etc/httpd/conf.d/*.conf<br  />
</p></dd>
<dt>服务脚本</dt><dd><p class="verse">
/etc/rc.d/init.d/httpd<br  />
配置文件：/etc/sysconfig/httpd<br  />
</p></dd>
<dt>主程序文件</dt><dd><p class="verse">
/usr/sbin/httpd: 使用prefork模型<br  />
/usr/sbin/httpd.event<br  />
/usr/sbin/httpd.worker<br  />
</p></dd>
<dt>日志文件</dt><dd><p class="verse">
/var/log/httpd/access_log: 访问日志<br  />
/var/log/httpd/error_log：错误日志<br  />
</p></dd>
<dt>站点文档目录</dt><dd>/var/www/html</dd>
<dt>模块文件路径</dt><dd>/usr/lib64/httpd/modules</dd>
</dl>
</div>
</div>
<div id="outline-container-orgheadline7" class="outline-3">
<h3 id="orgheadline7">配置文件</h3>
<div class="outline-text-3" id="text-orgheadline7">
</div><div id="outline-container-orgheadline4" class="outline-4">
<h4 id="orgheadline4">配置文件组成</h4>
<div class="outline-text-4" id="text-orgheadline4">
<div class="org-src-container">

<pre class="src src-conf"><span style="color: #75715E;">### </span><span style="color: #75715E;">Section 1: Global Environment</span>
<span style="color: #75715E;">### </span><span style="color: #75715E;">Section 2: 'Main' server configuration</span>
<span style="color: #75715E;">### </span><span style="color: #75715E;">Section 3: Virtual Hosts</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline5" class="outline-4">
<h4 id="orgheadline5">修改监听的IP和端口</h4>
<div class="outline-text-4" id="text-orgheadline5">
<div class="org-src-container">

<pre class="src src-conf">Listen [IP:]PORT
</pre>
</div>
<ul class="org-ul">
<li>省略ip表示监听本机所有IP</li>
<li>Listen可重复出现多次，即同时监听多个端口</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline6" class="outline-4">
<h4 id="orgheadline6">持久连接</h4>
</div>
</div>
</div>
